use mermaid instead
